MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO102LC2AN/mcu.h
    /**
     * SR
     * ===================================================================================================
     * Offset: 0x58  A/D Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADF       |A/D Conversion End Flag
     * |        |          |A status flag that indicates the end of A/D conversion.
     * |        |          |ADF is set to 1 at these two conditions:
     * |        |          |When A/D conversion ends in single mode
     * |        |          |When A/D conversion ends on all specified channels in scan mode.
     * |        |          |This flag can be cleared by writing 1 to it.
     * |[1]     |CMPF0     |Compare Flag
     * |        |          |When the selected channel A/D conversion result meets setting condition in ADCMPR0 then this bit is set to 1.
     * |        |          |And it is cleared by writing 1 to self.
     * |        |          |0 = Conversion result in ADC_RESULTx does not meet ADCMPR0setting.
     * |        |          |1 = Conversion result in ADC_RESULTx meets ADCMPR0setting.
     * |        |          |This flag can be cleared by writing 1 to it.
     * |        |          |Note: When this flag is set, the matching counter will be reset to 0,and continue to count when user write 1 to clear CMPF0
     * |[2]     |CMPF1     |Compare Flag
     * |        |          |When the selected channel A/D conversion result meets setting condition in ADCMPR1 then this bit is set to 1.
     * |        |          |And it is cleared by writing 1 to self.
     * |        |          |0 = Conversion result in ADC_RESULTx does not meet ADCMPR1 setting.
     * |        |          |1 = Conversion result in ADC_RESULTx meets ADCMPR1 setting.
     * |        |          |This flag can be cleared by writing 1 to it.
     * |        |          |Note: when this flag is set, the matching counter will be reset to 0,and continue to count when user write 1 to clear CMPF1
     * |[3]     |BUSY      |BUSY/IDLE
     * |        |          |0 = A/D converter is in idle state.
     * |        |          |1 = A/D converter is busy at conversion.
     * |        |          |This bit is a mirror of ADST bit in ADCR. That is to say if ADST = 1,then BUSY is 1 and vice versa.
     * |        |          |It is read only.
     * |[8:4]   |CHANNEL   |Current Conversion Channel
     * |        |          |This filed reflects current conversion channel when BUSY=1.
     * |        |          |When BUSY=0, it shows the next channel to be converted.
     * |        |          |It is read only.
     * |[16]    |INITRDY   |ADC Power-Up Sequence Completed
     * |        |          |0 = ADC not powered up after system reset.
     * |        |          |1 = ADC has been powered up since the last system reset.
     * |        |          |Note: This bit will be set after system reset occurred and automatically cleared by power-up event.
    */
    __IO uint32_t SR;
    uint32_t RESERVE1[1];

    /**
     * PDMA
     * ===================================================================================================
     * Offset: 0x60  A/D PDMA current transfer data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |AD_PDMA   |ADC PDMA Current Transfer Data Register
     * |        |          |When PDMA transferring, read this register can monitor current PDMA transfer data.
     * |        |          |This is a read only register.
    */
    __I  uint32_t PDMA;

    /**
     * PWRCTL
     * ===================================================================================================
     * Offset: 0x64  ADC Power Management Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWUPRDY   |ADC Power-Up Sequence Completed And Ready For Conversion
     * |        |          |0 = ADC is not ready for conversion; may be in power down state or in the progress of power up.
     * |        |          |1 = ADC is ready for conversion.
     * |[1]     |PWDCALEN  |Power Up Calibration Function Enable
     * |        |          |1 = Power up with calibration.
     * |        |          |0 = Power up without calibration.
     * |        |          |Note: This bit work together with CALFBKSEL set 1
     * |[3:2]   |PWDMOD    |Power-Down Mode
     * |        |          |00 = Power down
     * |        |          |01 = Reserved
     * |        |          |10 = Standby mode
     * |        |          |11 = Reserved
     * |        |          |Note: Different PWDMOD has different power down/up sequence, in order to avoid ADC powering up with wrong sequence; user must keep PWMOD consistent each time in powe down and power up
    */
    __IO uint32_t PWRCTL;

    /**
     * CALCTL
     * ===================================================================================================
     * Offset: 0x68  ADC Calibration  Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CALEN     |Calibration Function Enable
     * |        |          |Enable this bit to turn on the calibration function block.
     * |        |          |0 = Disable
     * |        |          |1 = Enabled.
     * |[1]     |CALSTART  |Calibration Functional Block Start
     * |        |          |0 = Stops calibration functional block.
     * |        |          |1 = Starts calibration functional block.
     * |        |          |Note: This bit is set by SW and clear by HW; don't write 1 to this bit while CALEN = 0.
     * |[2]     |CALDONE   |Calibrate Functional Block Complete
     * |        |          |0 = Not yet.
     * |        |          |1 = Selected functional block complete.
     * |[3]     |CALSEL    |Select Calibration Functional Block
     * |        |          |0 = Load calibration functional block.
     * |        |          |1 = Calibration functional block.
    */
    __IO uint32_t CALCTL;

    /**
     * CALWORD
     * ===================================================================================================
     * Offset: 0x6C  A/D calibration  load word register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[6:0]   |CALWORD   |Calibration Word Register
     * |        |          |Write to this register with the previous calibration word before load calibration action
     * |        |          |Read this register after calibration done
     * |        |          |Note: The calibration block contains two parts "CALIBRATION" and "LOAD CALIBRATION"; if the calibration block is config as "CALIBRATION"; then this register represent the result of calibration when calibration is completed; if config as "LOAD CALIBRATION" ; config this register before loading calibration action, after loading calibration complete, the loaded calibration word will apply to the ADC;while in loading calibration function the loaded value will not be equal to the original CALWORD until calibration is done.
    */
    __IO uint32_t CALWORD;

    /**
     * SMPLCNT0
     * ===================================================================================================
     * Offset: 0x70  ADC Channel Sampling Time  Counter Register Group 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |CH0SAMPCNT|Channel 0 Sampling Counter
     * |        |          |0000 = 0 ADC clock
     * |        |          |0001 = 1 ADC clock
     * |        |          |0010 = 2 ADC clocks
     * |        |          |0011 = 4 ADC clocks
     * |        |          |0100 = 8 ADC clocks
     * |        |          |0101 = 16 ADC clocks
     * |        |          |0110 = 32 ADC clocks
     * |        |          |0111 = 64 ADC clocks
     * |        |          |1000 = 128 ADC clocks
     * |        |          |1001 = 256 ADC clocks
     * |        |          |1010 = 512 ADC clocks
     * |        |          |Others = 1024 ADC clocks
     * |[7:4]   |CH1SAMPCNT|Channel 1 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[11:8]  |CH2SAMPCNT|Channel 2 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[15:12] |CH3SAMPCNT|Channel 3 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[19:16] |CH4SAMPCNT|Channel 4 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[23:20] |CH5SAMPCNT|Channel 5 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[27:24] |CH6SAMPCNT|Channel 6 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[31:28] |CH7SAMPCNT|Channel 7 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
    */
    __IO uint32_t SMPLCNT0;

    /**
     * SMPLCNT1
     * ===================================================================================================
     * Offset: 0x74  ADC Channel Sampling Time  Counter Register Group 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[19:16] |INTCHSAMPCNT|Internal Channel (VTEMP, AVDD, AVSS, Int_VREF) Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
    */
    __IO uint32_t SMPLCNT1;

} ADC_T;

/**
    @addtogroup ADC_CONST ADC Bit Field Definition
    Constant Definitions for ADC Controller
@{ */

#define ADC_RESULT_RSLT_Pos              (0)                                               /*!< ADC_T::RESULT: RSLT Position              */
#define ADC_RESULT_RSLT_Msk              (0xffful << ADC_RESULT_RSLT_Pos)                  /*!< ADC_T::RESULT: RSLT Mask                  */

