MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO102LC2AN/mcu.h
#define CLK_CLKSEL1_PWM0_CH01_S_Pos      (4)                                               /*!< CLK_T::CLKSEL1: PWM0_CH01_S Position      */
#define CLK_CLKSEL1_PWM0_CH01_S_Msk      (0x3ul << CLK_CLKSEL1_PWM0_CH01_S_Pos)            /*!< CLK_T::CLKSEL1: PWM0_CH01_S Mask          */

#define CLK_CLKSEL1_PWM0_CH23_S_Pos      (6)                                               /*!< CLK_T::CLKSEL1: PWM0_CH23_S Position      */
#define CLK_CLKSEL1_PWM0_CH23_S_Msk      (0x3ul << CLK_CLKSEL1_PWM0_CH23_S_Pos)            /*!< CLK_T::CLKSEL1: PWM0_CH23_S Mask          */

#define CLK_CLKSEL1_TMR0_S_Pos           (8)                                               /*!< CLK_T::CLKSEL1: TMR0_S Position           */
#define CLK_CLKSEL1_TMR0_S_Msk           (0x7ul << CLK_CLKSEL1_TMR0_S_Pos)                 /*!< CLK_T::CLKSEL1: TMR0_S Mask               */

#define CLK_CLKSEL1_TMR1_S_Pos           (12)                                              /*!< CLK_T::CLKSEL1: TMR1_S Position           */
#define CLK_CLKSEL1_TMR1_S_Msk           (0x7ul << CLK_CLKSEL1_TMR1_S_Pos)                 /*!< CLK_T::CLKSEL1: TMR1_S Mask               */

#define CLK_CLKSEL1_LCD_S_Pos            (18)                                              /*!< CLK_T::CLKSEL1: LCD_S Position            */
#define CLK_CLKSEL1_LCD_S_Msk            (0x1ul << CLK_CLKSEL1_LCD_S_Pos)                  /*!< CLK_T::CLKSEL1: LCD_S Mask                */

#define CLK_CLKSEL1_ADC_S_Pos            (19)                                              /*!< CLK_T::CLKSEL1: ADC_S Position            */
#define CLK_CLKSEL1_ADC_S_Msk            (0x7ul << CLK_CLKSEL1_ADC_S_Pos)                  /*!< CLK_T::CLKSEL1: ADC_S Mask                */

#define CLK_CLKSEL2_FRQDIV1_S_Pos        (0)                                               /*!< CLK_T::CLKSEL2: FRQDIV1_S Position        */
#define CLK_CLKSEL2_FRQDIV1_S_Msk        (0x3ul << CLK_CLKSEL2_FRQDIV1_S_Pos)              /*!< CLK_T::CLKSEL2: FRQDIV1_S Mask            */

#define CLK_CLKSEL2_FRQDIV0_S_Pos        (2)                                               /*!< CLK_T::CLKSEL2: FRQDIV0_S Position        */
#define CLK_CLKSEL2_FRQDIV0_S_Msk        (0x3ul << CLK_CLKSEL2_FRQDIV0_S_Pos)              /*!< CLK_T::CLKSEL2: FRQDIV0_S Mask            */

#define CLK_CLKSEL2_TMR2_S_Pos           (8)                                               /*!< CLK_T::CLKSEL2: TMR2_S Position           */
#define CLK_CLKSEL2_TMR2_S_Msk           (0x7ul << CLK_CLKSEL2_TMR2_S_Pos)                 /*!< CLK_T::CLKSEL2: TMR2_S Mask               */

#define CLK_CLKSEL2_TMR3_S_Pos           (12)                                              /*!< CLK_T::CLKSEL2: TMR3_S Position           */
#define CLK_CLKSEL2_TMR3_S_Msk           (0x7ul << CLK_CLKSEL2_TMR3_S_Pos)                 /*!< CLK_T::CLKSEL2: TMR3_S Mask               */

#define CLK_CLKSEL2_SC_S_Pos             (18)                                              /*!< CLK_T::CLKSEL2: SC_S Position             */
#define CLK_CLKSEL2_SC_S_Msk             (0x3ul << CLK_CLKSEL2_SC_S_Pos)                   /*!< CLK_T::CLKSEL2: SC_S Mask                 */

#define CLK_CLKSEL2_SPI0_S_Pos           (20)                                              /*!< CLK_T::CLKSEL2: SPI0_S Position           */
#define CLK_CLKSEL2_SPI0_S_Msk           (0x1ul << CLK_CLKSEL2_SPI0_S_Pos)                 /*!< CLK_T::CLKSEL2: SPI0_S Mask               */

#define CLK_CLKSEL2_SPI1_S_Pos           (21)                                              /*!< CLK_T::CLKSEL2: SPI1_S Position           */
#define CLK_CLKSEL2_SPI1_S_Msk           (0x1ul << CLK_CLKSEL2_SPI1_S_Pos)                 /*!< CLK_T::CLKSEL2: SPI1_S Mask               */

#define CLK_CLKDIV0_HCLK_N_Pos           (0)                                               /*!< CLK_T::CLKDIV0: HCLK_N Position           */
#define CLK_CLKDIV0_HCLK_N_Msk           (0xful << CLK_CLKDIV0_HCLK_N_Pos)                 /*!< CLK_T::CLKDIV0: HCLK_N Mask               */

#define CLK_CLKDIV0_UART_N_Pos           (8)                                               /*!< CLK_T::CLKDIV0: UART_N Position           */
#define CLK_CLKDIV0_UART_N_Msk           (0xful << CLK_CLKDIV0_UART_N_Pos)                 /*!< CLK_T::CLKDIV0: UART_N Mask               */

#define CLK_CLKDIV0_ADC_N_Pos            (16)                                              /*!< CLK_T::CLKDIV0: ADC_N Position            */
#define CLK_CLKDIV0_ADC_N_Msk            (0xfful << CLK_CLKDIV0_ADC_N_Pos)                 /*!< CLK_T::CLKDIV0: ADC_N Mask                */

#define CLK_CLKDIV0_SC0_N_Pos            (28)                                              /*!< CLK_T::CLKDIV0: SC0_N Position            */
#define CLK_CLKDIV0_SC0_N_Msk            (0xful << CLK_CLKDIV0_SC0_N_Pos)                  /*!< CLK_T::CLKDIV0: SC0_N Mask                */

#define CLK_CLKDIV1_SC1_N_Pos            (0)                                               /*!< CLK_T::CLKDIV1: SC1_N Position            */
#define CLK_CLKDIV1_SC1_N_Msk            (0xful << CLK_CLKDIV1_SC1_N_Pos)                  /*!< CLK_T::CLKDIV1: SC1_N Mask                */

#define CLK_CLKDIV1_TMR0_N_Pos           (8)                                               /*!< CLK_T::CLKDIV1: TMR0_N Position           */
#define CLK_CLKDIV1_TMR0_N_Msk           (0xful << CLK_CLKDIV1_TMR0_N_Pos)                 /*!< CLK_T::CLKDIV1: TMR0_N Mask               */

#define CLK_CLKDIV1_TMR1_N_Pos           (12)                                              /*!< CLK_T::CLKDIV1: TMR1_N Position           */
#define CLK_CLKDIV1_TMR1_N_Msk           (0xful << CLK_CLKDIV1_TMR1_N_Pos)                 /*!< CLK_T::CLKDIV1: TMR1_N Mask               */

#define CLK_CLKDIV1_TMR2_N_Pos           (16)                                              /*!< CLK_T::CLKDIV1: TMR2_N Position           */
#define CLK_CLKDIV1_TMR2_N_Msk           (0xful << CLK_CLKDIV1_TMR2_N_Pos)                 /*!< CLK_T::CLKDIV1: TMR2_N Mask               */

#define CLK_CLKDIV1_TMR3_N_Pos           (20)                                              /*!< CLK_T::CLKDIV1: TMR3_N Position           */
#define CLK_CLKDIV1_TMR3_N_Msk           (0xful << CLK_CLKDIV1_TMR3_N_Pos)                 /*!< CLK_T::CLKDIV1: TMR3_N Mask               */

#define CLK_PLLCTL_PLL_MLP_Pos           (0)                                               /*!< CLK_T::PLLCTL: PLL_MLP Position           */
#define CLK_PLLCTL_PLL_MLP_Msk           (0x3ful << CLK_PLLCTL_PLL_MLP_Pos)                /*!< CLK_T::PLLCTL: PLL_MLP Mask               */

