MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO102LC2AN/mcu.h
#define FMC_ISPCON_BS_Pos                (1)                                               /*!< FMC_T::ISPCON: BS Position                */
#define FMC_ISPCON_BS_Msk                (0x1ul << FMC_ISPCON_BS_Pos)                      /*!< FMC_T::ISPCON: BS Mask                    */

#define FMC_ISPCON_APUEN_Pos             (3)                                               /*!< FMC_T::ISPCON: APUEN Position             */
#define FMC_ISPCON_APUEN_Msk             (0x1ul << FMC_ISPCON_APUEN_Pos)                   /*!< FMC_T::ISPCON: APUEN Mask                 */

#define FMC_ISPCON_CFGUEN_Pos            (4)                                               /*!< FMC_T::ISPCON: CFGUEN Position            */
#define FMC_ISPCON_CFGUEN_Msk            (0x1ul << FMC_ISPCON_CFGUEN_Pos)                  /*!< FMC_T::ISPCON: CFGUEN Mask                */

#define FMC_ISPCON_LDUEN_Pos             (5)                                               /*!< FMC_T::ISPCON: LDUEN Position             */
#define FMC_ISPCON_LDUEN_Msk             (0x1ul << FMC_ISPCON_LDUEN_Pos)                   /*!< FMC_T::ISPCON: LDUEN Mask                 */

#define FMC_ISPCON_ISPFF_Pos             (6)                                               /*!< FMC_T::ISPCON: ISPFF Position             */
#define FMC_ISPCON_ISPFF_Msk             (0x1ul << FMC_ISPCON_ISPFF_Pos)                   /*!< FMC_T::ISPCON: ISPFF Mask                 */

#define FMC_ISPADR_ISPADR_Pos            (0)                                               /*!< FMC_T::ISPADR: ISPADR Position            */
#define FMC_ISPADR_ISPADR_Msk            (0xfffffffful << FMC_ISPADR_ISPADR_Pos)           /*!< FMC_T::ISPADR: ISPADR Mask                */

#define FMC_ISPDAT_ISPDAT_Pos            (0)                                               /*!< FMC_T::ISPDAT: ISPDAT Position            */
#define FMC_ISPDAT_ISPDAT_Msk            (0xfffffffful << FMC_ISPDAT_ISPDAT_Pos)           /*!< FMC_T::ISPDAT: ISPDAT Mask                */

#define FMC_ISPCMD_FCTRL_Pos             (0)                                               /*!< FMC_T::ISPCMD: FCTRL Position             */
#define FMC_ISPCMD_FCTRL_Msk             (0xful << FMC_ISPCMD_FCTRL_Pos)                   /*!< FMC_T::ISPCMD: FCTRL Mask                 */

#define FMC_ISPCMD_FCEN_Pos              (4)                                               /*!< FMC_T::ISPCMD: FCEN Position              */
#define FMC_ISPCMD_FCEN_Msk              (0x1ul << FMC_ISPCMD_FCEN_Pos)                    /*!< FMC_T::ISPCMD: FCEN Mask                  */

#define FMC_ISPCMD_FOEN_Pos              (5)                                               /*!< FMC_T::ISPCMD: FOEN Position              */
#define FMC_ISPCMD_FOEN_Msk              (0x1ul << FMC_ISPCMD_FOEN_Pos)                    /*!< FMC_T::ISPCMD: FOEN Mask                  */

#define FMC_ISPTRG_ISPGO_Pos             (0)                                               /*!< FMC_T::ISPTRG: ISPGO Position             */
#define FMC_ISPTRG_ISPGO_Msk             (0x1ul << FMC_ISPTRG_ISPGO_Pos)                   /*!< FMC_T::ISPTRG: ISPGO Mask                 */

#define FMC_DFBADR_DFBADR_Pos            (0)                                               /*!< FMC_T::DFBADR: DFBADR Position            */
#define FMC_DFBADR_DFBADR_Msk            (0xfffffffful << FMC_DFBADR_DFBADR_Pos)           /*!< FMC_T::DFBADR: DFBADR Mask                */

#define FMC_ISPSTA_ISPBUSY_Pos           (0)                                               /*!< FMC_T::ISPSTA: ISPBUSY Position           */
#define FMC_ISPSTA_ISPBUSY_Msk           (0x1ul << FMC_ISPSTA_ISPBUSY_Pos)                 /*!< FMC_T::ISPSTA: ISPBUSY Mask               */

#define FMC_ISPSTA_CBS_Pos               (1)                                               /*!< FMC_T::ISPSTA: CBS Position               */
#define FMC_ISPSTA_CBS_Msk               (0x3ul << FMC_ISPSTA_CBS_Pos)                     /*!< FMC_T::ISPSTA: CBS Mask                   */

#define FMC_ISPSTA_PGFF_Pos              (5)                                               /*!< FMC_T::ISPSTA: PGFF Position              */
#define FMC_ISPSTA_PGFF_Msk              (0x1ul << FMC_ISPSTA_PGFF_Pos)                    /*!< FMC_T::ISPSTA: PGFF Mask                  */

#define FMC_ISPSTA_ISPFF_Pos             (6)                                               /*!< FMC_T::ISPSTA: ISPFF Position             */
#define FMC_ISPSTA_ISPFF_Msk             (0x1ul << FMC_ISPSTA_ISPFF_Pos)                   /*!< FMC_T::ISPSTA: ISPFF Mask                 */

/**@}*/ /* FMC_CONST */
/**@}*/ /* end of FMC register group */


/*---------------------- System Global Control Registers -------------------------*/
/**
    @addtogroup SYS System Global Control Registers(SYS)
    Memory Mapped Structure for SYS Controller
@{ */

typedef struct
{


    /**
     * PDID
     * ===================================================================================================
     * Offset: 0x00  Part Device Identification Number Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |PDID      |Part Device ID
     * |        |          |This register reflects device part number code.
     * |        |          |Software can read this register to identify which device is used.
    */
    __I  uint32_t PDID;

    /**
     * RST_SRC
     * ===================================================================================================
     * Offset: 0x04  System Reset Source Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |RSTS_POR  |The RSTS_POR Flag Is Set By The "Reset Signal" From The Power-On Reset (POR) Module Or Bit CHIP_RST (IPRSTC1[0]) To Indicate The Previous Reset Source
     * |        |          |0 = No reset from POR or CHIP_RST.
     * |        |          |1 = Power-on Reset (POR) or CHIP_RST had issued the reset signal to reset the system.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[1]     |RSTS_PAD  |The RSTS_PAD Flag Is Set By The "Reset Signal" From The /RESET Pin Or Power Related Reset Sources To Indicate The Previous Reset Source
     * |        |          |0 = No reset from nRESET pin.
     * |        |          |1 = The /RESET pin had issued the reset signal to reset the system.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[2]     |RSTS_WDT  |The RSTS_WDT Flag Is Set By The "Reset Signal" From The Watchdog Timer Module To Indicate The Previous Reset Source
     * |        |          |0 = No reset from Watchdog Timer.
     * |        |          |1 = The Watchdog Timer module had issued the reset signal to reset the system.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[4]     |RSTS_BOD  |The RSTS_BOD Flag Is Set By The "Reset Signal" From The Brown-Out-Detected Module To Indicate The Previous Reset Source
     * |        |          |0 = No reset from BOD.
     * |        |          |1 = Brown-out-Detected module had issued the reset signal to reset the system.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[5]     |RSTS_SYS  |The RSTS_SYS Flag Is Set By The "Reset Signal" From The Cortex_M0 Kernel To Indicate The Previous Reset Source
     * |        |          |0 = No reset from Cortex_M0.
     * |        |          |1 = Cortex_M0 had issued the reset signal to reset the system by writing 1 to the bit SYSRESTREQ(AIRCR[2], Application Interrupt and Reset Control Register) in system control registers of Cortex_M0 kernel.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[7]     |RSTS_CPU  |The RSTS_CPU Flag Is Set By Hardware If Software Writes CPU_RST (IPRST_CTL1[1]) "1" To Rest Cortex-M0 Core And Flash Memory Controller (FMC)
     * |        |          |0 = No reset from CPU.
     * |        |          |1 = Cortex-M0 core and FMC are reset by software setting CPU_RST to 1.
     * |        |          |Note: This bit is cleared by writing 1 to it.
    */
    __IO uint32_t RST_SRC;

    /**
     * IPRST_CTL1
     * ===================================================================================================
     * Offset: 0x08  Peripheral Reset Control Resister1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CHIP_RST  |Chip One-Shot Reset
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |Setting this bit will reset the whole chip, including Cortex-M0 core and all peripherals like power-on reset and this bit will automatically return to "0" after the 2 clock cycles.
     * |        |          |The chip setting from flash will be also reloaded when chip one shot reset.
     * |        |          |0 = Normal.
     * |        |          |1 = Reset chip.
     * |        |          |Note: In the following conditions, chip setting from flash will be reloaded.
     * |        |          |Power-on Reset
     * |        |          |Brown-out-Detected Reset
     * |        |          |Low level on the nRESET pin
     * |        |          |Set IPRST_CTL1[CHIP_RST]
     * |[1]     |CPU_RST   |Cortex-M0 Core One-Shot Reset
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |Setting this bit will only reset the Cortex-M0 core and Flash Memory Controller (FMC), and this bit will automatically return to "0" after the 2 clock cycles
     * |        |          |0 = Normal.
     * |        |          |1 = Reset Cortex-M0 core.
     * |[2]     |DMA_RST   |DMA Controller Reset
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |Set this bit "1" will generate a reset signal to the DMA.
     * |        |          |SW needs to set this bit to low to release reset signal.
     * |        |          |0 = Normal operation.
     * |        |          |1 = DMA IP reset.
    */
    __IO uint32_t IPRST_CTL1;

    /**
     * IPRST_CTL2
     * ===================================================================================================
     * Offset: 0x0C  Peripheral Reset Control Resister2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |GPIO_RST  |GPIO Controller Reset
     * |        |          |0 = GPIO module normal operation.
     * |        |          |1 = GPIO module reset.
     * |[2]     |TMR0_RST  |Timer0 Controller Reset
     * |        |          |0 = Timer0 module normal operation.
     * |        |          |1 = Timer0 module reset.
     * |[3]     |TMR1_RST  |Timer1 Controller Reset
     * |        |          |0 = Timer1 module normal operation.
     * |        |          |1 = Timer1 module reset.
     * |[4]     |TMR2_RST  |Timer2 Controller Reset
     * |        |          |0 = Timer2 module normal operation.
     * |        |          |1 = Timer2 module reset.
     * |[5]     |TMR3_RST  |Timer3 Controller Reset
     * |        |          |0 = Timer3 module normal operation.
     * |        |          |1 = Timer3 module reset.
     * |[8]     |I2C0_RST  |I2C0 Controller Reset
     * |        |          |0 = I2C0 module normal operation.
     * |        |          |1 = I2C0 module reset.
     * |[9]     |I2C1_RST  |I2C1 Controller Reset
     * |        |          |0 = I2C1 module normal operation.
     * |        |          |1 = I2C1 module reset.
     * |[12]    |SPI0_RST  |SPI0 Controller Reset
     * |        |          |0 = SPI0 module normal operation.
     * |        |          |1 = SPI0 module reset.
     * |[13]    |SPI1_RST  |SPI1 Controller Reset
     * |        |          |0 = SPI1 module normal operation.
     * |        |          |1 = SPI1 module reset.
     * |[16]    |UART0_RST |UART0 Controller Reset
     * |        |          |0 = UART0 module normal operation.
     * |        |          |1 = UART0 module reset.
     * |[17]    |UART1_RST |UART1 Controller Reset
     * |        |          |0 = UART1 module normal operation.
     * |        |          |1 = UART1 module reset.
     * |[20]    |PWM0_RST  |PWM0 Controller Reset
     * |        |          |0 = PWM0 module normal operation.
     * |        |          |1 = PWM0 module reset.
     * |[22]    |ACMP01_RST|Comparator Controller Reset
     * |        |          |0 = Comparator module normal operation.
     * |        |          |1 = Comparator module reset.
     * |[26]    |LCD_RST   |LCD Controller Reset
     * |        |          |0 = LCD module normal operation.
     * |        |          |1 = LCD module reset.
     * |[28]    |ADC_RST   |ADC Controller Reset
     * |        |          |0 = ADC module normal operation.
     * |        |          |1 = ADC module reset.
     * |[30]    |SC0_RST   |SmartCard 0 Controller Reset
     * |        |          |0 = SmartCard module normal operation.
     * |        |          |1 = SmartCard module reset.
     * |[31]    |SC1_RST   |SmartCard1 Controller Reset
     * |        |          |0 = SmartCard module normal operation.
     * |        |          |1 = SmartCard module reset.
    */
    __IO uint32_t IPRST_CTL2;

    uint32_t RESERVE0[4];
    /**
     * TEMPCTL
     * ===================================================================================================
     * Offset: 0x20  Temperature Sensor Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |VTEMP_EN  |Temperature Sensor Enable Control
     * |        |          |0 = Temperature sensor function Disabled (default).
     * |        |          |1 = Temperature sensor function Enabled.
    */
    __IO uint32_t TEMPCTL;
    uint32_t RESERVE1[3];


    /**
     * PA_L_MFP
     * ===================================================================================================
     * Offset: 0x30  Port A Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PA0_MFP   |PA.0 Pin Function Selection
     * |        |          |0000 = GPIOA[0]
     * |        |          |0010 = ADC input channel 0
     * |[6:4]   |PA1_MFP   |PA.1 Pin Function Selection
     * |        |          |0000 = GPIOA[1]
     * |        |          |0010 = ADC analog input1
     * |        |          |0011 = Comparator0 P-end input3
     * |        |          |1001 = Comparator0 charge/discharge path
     * |[11:8]  |PA2_MFP   |PA.2 Pin Function Selection
     * |        |          |0000 = GPIOA[2]
     * |        |          |0001 = External interrupt0 input pin
     * |        |          |0010 = ADC analog input2
     * |        |          |0011 = Comparator0 P-end input2
     * |        |          |0100 = SmartCard0 clock pin(SC0_UART_TXD)
     * |        |          |1001 = Comparator0 charge/discharge path
     * |[14:12] |PA3_MFP   |PA.3 Pin Function Selection
     * |        |          |0000 = GPIOA[3]
     * |        |          |0001 = External interrupt 1
     * |        |          |0010 = ADC analog input3
     * |        |          |0011 = Comparator0 P-end input1
     * |        |          |0100 = SmartCard0 DATA pin(SC0_UART_RXD)
     * |        |          |1001 = Comparator0 charge/discharge path
     * |[19:16] |PA4_MFP   |PA.4 Pin Function Selection
     * |        |          |0000 = GPIOA[4]
     * |        |          |0010 = ADC analog input4
     * |        |          |0011 = Comparator0 P-end input0
     * |        |          |0100 = SmartCard0 card detect pin
     * |        |          |1001 = Comparator0 charge/discharge path
     * |[23:20] |PA5_MFP   |PA.5 Pin Function Selection
     * |        |          |0000 = GPIOA[5]
     * |        |          |0010 = ADC analog input5
     * |        |          |0011 = Comparator0 N-end input0
     * |        |          |0100 = SmartCard0 Power pin
     * |        |          |0101 = I2C1 data I/O pin
     * |        |          |0110 = SPI1 1st slave select pin
     * |        |          |1001 = Comparator0 charge/discharge path
     * |[27:24] |PA6_MFP   |PA.6 Pin Function Selection
     * |        |          |0000 = GPIOA[6]
     * |        |          |0010 = ADC analog input6
     * |        |          |0011 = Comparator0 output
     * |        |          |0100 = SmartCard0 RST pin
     * |        |          |1001 = Comparator0 charge/discharge path
     * |[31:28] |PA7_MFP   |PA.7 Pin Function Selection
     * |        |          |0000 = GPIOA[7]
     * |        |          |0010 = ADC input channel 7
     * |        |          |0100 = SmartCard1 card detect
    */
    __IO uint32_t PA_L_MFP;

    /**
     * PA_H_MFP
     * ===================================================================================================
     * Offset: 0x34  Port A High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PA8_MFP   |PA.8 Pin Function Selection
     * |        |          |0000 = GPIOA[8]
     * |        |          |0100 = SmartCard0 Power pin
     * |[7:4]   |PA9_MFP   |PA.9 Pin Function Selection
     * |        |          |0000 = GPIOA[9]
     * |        |          |0100 = SmartCard0 RST pin
     * |[11:8]  |PA10_MFP  |PA.10 Pin Function Selection
     * |        |          |0000 = GPIOA[10]
     * |        |          |0100 = SmartCard0 CLK pin
     * |[15:12] |PA11_MFP  |PA.11 Pin Function Selection
     * |        |          |0000 = GPIOA[11]
     * |        |          |0010 = ADC external trigger input.
     * |        |          |0100 = SmartCard0 DATA pin(SC0_UART_RXD)
     * |[18:16] |PA12_MFP  |PA.12 Pin Function Selection
     * |        |          |0000 = GPIOA[12]
     * |        |          |0011 = Comparator1 P-end input
     * |        |          |0101 = I2C 0 clock pin
     * |        |          |0110 = SPI1 1st MOSI (Master Out, Slave In) pin
     * |        |          |0111 = UART0 Data transmitter output pin(This pin could modulate with PWM0 output. Please refer PWM_SEL(UARTx_CTL[26:24])).
     * |        |          |1000 = LCD segment output 19 at 48-pin package
     * |[22:20] |PA13_MFP  |PA.13 Pin Function Selection
     * |        |          |0000 = GPIOA[13]
     * |        |          |0011 = Comparator1 N-end input
     * |        |          |0101 = I2C0 data I/O pin
     * |        |          |0110 = SPI1 1st MISO (Master In, Slave Out) pin
     * |        |          |0111 = UART0 Data receiver input pin
     * |        |          |1000 = LCD segment output 18 at 48-pin package
     * |[26:24] |PA14_MFP  |PA.14 Pin Function Selection
     * |        |          |0000 = GPIOA[14]
     * |        |          |0101 = I2C1 clock pin
     * |        |          |0110 = SPI1 serial clock pin
     * |        |          |1000 = LCD segment output 17 at 48-pin package, LCD segment output 31 at 64-pin package
     * |        |          |1001 = Comparator0 charge/discharge path
     * |[31:28] |PA15_MFP  |PA.15 Pin Function Selection
     * |        |          |0000 = GPIOA[15]
     * |        |          |0010 = Timer3 capture input
     * |        |          |0011 = Comparator1 output
     * |        |          |0101 = I2C1 data I/O pin
     * |        |          |0110 = SPI1 1st slave select pin
     * |        |          |1000 = LCD segment output 16 at 48-pin package, LCD segment output 30 at 64-pin package
    */
    __IO uint32_t PA_H_MFP;

    /**
     * PB_L_MFP
     * ===================================================================================================
     * Offset: 0x38  Port B Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PB0_MFP   |PB.0 Pin Function Selection
     * |        |          |0000 = GPIOB[0]
     * |        |          |0001 = Frequency Divider1 output pin
     * |        |          |0111 = UART0 Data transmitter output pin(This pin could modulate with PWM0 output. Please refer PWM_SEL(UARTx_CTL[26:24])).
     * |        |          |1000 = LCD segment output 29 at 64-pin package
     * |[7:4]   |PB1_MFP   |PB.1 Pin Function Selection
     * |        |          |0000 = GPIOB[1]
     * |        |          |0001 = External interrupt1 input pin
     * |        |          |0010 = Timer 2 capture input
     * |        |          |0111 = UART0 Data receiver input pin
     * |        |          |1000 = LCD segment output 28 at 64-pin package
     * |[11:8]  |PB2_MFP   |PB.2 Pin Function Selection
     * |        |          |0000 = GPIOB[2]
     * |        |          |0010 = Timer3 external counter input
     * |        |          |0101 = I2C0 clock pin
     * |        |          |0110 = SPI1 2nd MOSI (Master Out, Slave In) pin
     * |        |          |0111 = UART0 Request to Send output pin
     * |        |          |1000 = LCD segment output 27 at 64-pin package
     * |[15:12] |PB3_MFP   |PB.3 Pin Function Selection
     * |        |          |0000 = GPIOB[3]
     * |        |          |0010 = Timer2 external counter input
     * |        |          |0101 = I2C0 data I/O pin
     * |        |          |0110 = SPI1 2nd MISO (Master In, Slave Out) pin
     * |        |          |0111 = UART0 Clear to Send input pin
     * |        |          |1000 = LCD segment output 26 at 64-pin package
     * |[19:16] |PB4_MFP   |PB.4 Pin Function Selection
     * |        |          |0000 = GPIOB[4]
     * |        |          |0110 = SPI1 2nd MISO (Master In, Slave Out) pin
     * |        |          |0111 = UART1 Request to Send output pin
     * |[23:20] |PB5_MFP   |PB.5 Pin Function Selection
     * |        |          |0000 = GPIOB[5]
     * |        |          |0110 = SPI1 2nd MOSI (Master Out, Slave In) pin SmartCard0 RST
     * |        |          |0111 = UART1 Data receiver input pin
     * |        |          |1000 = LCD segment output 35 at 100-pin package
     * |[27:24] |PB6_MFP   |PB.6 Pin Function Selection
     * |        |          |0000 = GPIOB[6]
     * |        |          |0001 = Frequency Divider0 output pin
     * |        |          |0110 = SPI1 2nd slave select pin
     * |        |          |0111 = UART1 Data transmitter output pin(This pin could modulate with PWM0 output. Please refer PWM_SEL(UARTx_CTL[26:24])).
     * |        |          |1000 = LCD segment output 25 at 64-pin package, LCD segment output 34 at 100-pin package
     * |[31:28] |PB7_MFP   |PB.7 Pin Function Selection
     * |        |          |0000 = GPIOB[7]
     * |        |          |0100 = SmartCard0 card detect
     * |        |          |0111 = UART1 Clear to Send input pin
     * |        |          |1000 = LCD segment output 33 at 100-pin package
    */
    __IO uint32_t PB_L_MFP;

