MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO102LC2AN/mcu.h
    /**
     * PB_H_MFP
     * ===================================================================================================
     * Offset: 0x3C  Port B High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PB8_MFP   |PB.8 Pin Function Selection
     * |        |          |0000 = GPIOB[8]
     * |        |          |0001 = External interrupt1 input pin
     * |        |          |0010 = Timer0 external counter input or Timer0 toggle out.
     * |        |          |0011 = PWM0 Channel0 output
     * |        |          |0100 = Snooper pin
     * |        |          |1000 = LCD segment output 32 at 100-pin package
     * |[7:4]   |PB9_MFP   |PB.9 Pin Function Selection
     * |        |          |0000 = GPIOB[9]
     * |        |          |0011 = PWM0 Channel1 output
     * |        |          |1000 = LCD segment output 31 at 100-pin package
     * |[11:8]  |PB10_MFP  |PB.10 Pin Function Selection
     * |        |          |0000 = GPIOB[10]
     * |        |          |0110 = SPI0 2nd MOSI (Master Out, Slave In) pin
     * |        |          |0111 = UART1 Data receiver input pin
     * |        |          |1000 = LCD segment output 24 at 64-pin package, LCD segment output 28 at 100-pin package
     * |[15:12] |PB11_MFP  |PB.11 Pin Function Selection
     * |        |          |0000 = GPIOB[11]
     * |        |          |0010 = Timer1 external counter input or Timer1 toggle out
     * |        |          |0110 = SPI0 2nd MISO (Master In, Slave Out) pin
     * |        |          |0111 = UART1 Request to Send output pin
     * |        |          |1000 = LCD segment output 23 at 64-pin package, LCD segment output 27 at 100-pin package
     * |[19:16] |PB12_MFP  |PB.12 Pin Function Selection
     * |        |          |0000 = GPIOB[12]
     * |        |          |0001 = Frequency Divider0 output pin
     * |        |          |0010 = Timer0 external counter input or Timer0 toggle out.
     * |        |          |0110 = SPI0 1st MOSI (Master Out, Slave In) pin
     * |        |          |0111 = UART0 Request to Send output pin
     * |        |          |1000 = LCD segment output 15 at 48-pin package, LCD segment output 22 at 64-pin package, LCD segment output 26 at 100-pin package
     * |[23:20] |PB13_MFP  |PB.13 Pin Function Selection
     * |        |          |0000 = GPIOB[13]
     * |        |          |0110 = SPI0 1st MISO (Master In, Slave Out) pin
     * |        |          |0111 = UART0 Data receiver input pin
     * |        |          |1000 = LCD segment output 14 at 48-pin package, LCD segment output 21 at 64-pin package, LCD segment output 25 at 100-pin package
     * |[27:24] |PB14_MFP  |PB.14 Pin Function Selection
     * |        |          |0000 = GPIOB[14]
     * |        |          |0110 = SPI0 serial clock pin
     * |        |          |0111 = UART0 Data transmitter output pin(This pin could modulate with PWM0 output)
     * |        |          |1000 = LCD segment output 13 at 48-pin package, LCD segment output 20 at 64-pin package, LCD segment output 24 at 100-pin package
     * |[31:28] |PB15_MFP  |PB.15 Pin Function Selection
     * |        |          |0000 = GPIOB[15]
     * |        |          |0110 = SPI0 1st slave select pin
     * |        |          |0111 = UART0 Clear to Send input pin
     * |        |          |1000 = LCD segment output 12 at 48-pin package, LCD segment output 19 at 64-pin package, LCD segment output 23 at 100-pin package
    */
    __IO uint32_t PB_H_MFP;

    /**
     * PC_L_MFP
     * ===================================================================================================
     * Offset: 0x40  Port C Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PC0_MFP   |PC.0 Pin Function Selection
     * |        |          |0000 = GPIOC[0]
     * |        |          |0011 = PWM0 Channel0 output
     * |        |          |0101 = I2C0 clock pin
     * |        |          |0110 = SPI0 2nd slave select pin
     * |        |          |1000 = LCD segment output 11 at 48-pin package, LCD segment output 18 at 64-pin package, LCD segment output 22 at 100-pin package
     * |[7:4]   |PC1_MFP   |PC.1 Pin Function Selection
     * |        |          |0000 = GPIOC[1]
     * |        |          |0011 = PWM0 Channel1 output
     * |        |          |0101 = I2C0 data I/O pin
     * |        |          |1000 = LCD segment output 10 at 48-pin package, LCD segment output 17 at 64-pin package, LCD segment output 21 at 100-pin package
     * |[11:8]  |PC2_MFP   |PC.2 Pin Function Selection
     * |        |          |0000 = GPIOC[2]
     * |        |          |0011 = PWM0 Channel2 output
     * |        |          |0101 = I2C1 clock pin
     * |        |          |1000 = LCD segment output 9 at 48-pin package, LCD segment output 16 at 64-pin package, LCD segment output 20 at 100-pin package
     * |[15:12] |PC3_MFP   |PC.3 Pin Function Selection
     * |        |          |0000 = GPIOC[3]
     * |        |          |0011 = PWM0 Channel3 output
     * |        |          |0101 = I2C1 data I/O pin
     * |        |          |1000 = LCD segment output 8 at 48-pin package, LCD segment output 15 at 64-pin package, LCD segment output 19 at 100-pin package
     * |[19:16] |PC4_MFP   |PC.4 Pin Function Selection
     * |        |          |0000 = GPIOC[4]
     * |        |          |0001 = External interrupt0 input pin
     * |        |          |0100 = SmartCard0 clock pin(SC0_UART_TXD)
     * |        |          |0111 = UART1 Clear to Send input pin
     * |        |          |1000 = LCD segment output 7 at 48-pin package, LCD segment output 14 at 64-pin package, LCD segment output 18 at 100-pin package
     * |[23:20] |PC5_MFP   |PC.5 Pin Function Selection
     * |        |          |0000 = GPIOC[5]
     * |        |          |0100 = SmartCard0 card detect pin
     * |        |          |1000 = LCD segment output 6 at 48-pin package, LCD segment output 13 at 64-pin package, LCD segment output 17 at 100-pin package
     * |[27:24] |PC6_MFP   |PC.6 Pin Function Selection
     * |        |          |0000 = GPIOC[6]
     * |        |          |0100 = SmartCard0 DATA pin(SC0_UART_RXD)
     * |        |          |0111 = UART1 Request to Send output pin
     * |        |          |1000 = LCD segment output 5 at 48-pin package, LCD segment output 12 at 64-pin package, LCD segment output 16 at 100-pin package
     * |[31:28] |PC7_MFP   |PC.7 Pin Function Selection
     * |        |          |0000 = GPIOC[7]
     * |        |          |0100 = SmartCard0 Power pin
     * |        |          |0111 = UART1 Data receiver input pin
     * |        |          |1000 = LCD segment output 4 at 48-pin package, LCD segment output 11 at 64-pin package, LCD segment output 15 at 100-pin package
    */
    __IO uint32_t PC_L_MFP;

    /**
     * PC_H_MFP
     * ===================================================================================================
     * Offset: 0x44  Port C High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PC8_MFP   |PC.8 Pin Function Selection
     * |        |          |0000 = GPIOC[8]
     * |        |          |0100 = SmartCard0 RST pin
     * |        |          |0111 = UART1 Data transmitter output pin(This pin could modulate with PWM0 output. Please refer PWM_SEL(UARTx_CTL[26:24])).
     * |        |          |1000 = LCD segment output 3 at 48-pin package, LCD segment output 10 at 64-pin package, LCD segment output 14 at 100-pin package
     * |[7:4]   |PC9_MFP   |PC.9 Pin Function Selection
     * |        |          |1000 = LCD segment output 2 at 48-pin package, LCD segment output 9 at 64-pin package, LCD segment output 13 at 100-pin package
     * |        |          |0000 = GPIOC[9]
     * |[11:8]  |PC10_MFP  |PC.10 Pin Function Selection
     * |        |          |0000 = GPIOC[10]
     * |        |          |0100 = SmartCard1 card detect
     * |        |          |0101 = I2C1 clock pin
     * |        |          |1000 = LCD segment output 12 at 100-pin package
     * |[15:12] |PC11_MFP  |PC.11 Pin Function Selection
     * |        |          |0000 = GPIOC[11]
     * |        |          |0100 = SmartCard1 PWR pin
     * |        |          |0101 = I2C 1 data I/O pin
     * |        |          |1000 = LCD segment output 11 at 100-pin package
     * |[19:16] |PC12_MFP  |PC.12 Pin Function Selection
     * |        |          |0000 = GPIOC[12]
     * |        |          |0100 = SmartCard1 clock pin(SC1_UART_TXD)
     * |        |          |1000 = LCD segment output 10 at 100-pin package
     * |[23:20] |PC13_MFP  |PC.13 Pin Function Selection
     * |        |          |0000 = GPIOC[13]
     * |        |          |0100 = SmartCard1 DATA pin(SC1_UART_RXD)
     * |        |          |1000 = LCD segment output 9 at 100-pin package
     * |[27:24] |PC14_MFP  |PC.14 Pin Function Selection
     * |        |          |0000 = GPIOC[14]
     * |        |          |0100 = SmartCard1 card detect
     * |        |          |1000 = LCD segment output 1 at 48-pin package, LCD segment output 8 at 64-pin package, LCD segment output 8 at 100-pin package
     * |[31:28] |PC15_MFP  |PC.15 Pin Function Selection
     * |        |          |0000 = GPIOC[15]
     * |        |          |0100 = SmartCard1 PWR pin
     * |        |          |1000 = LCD segment output 0 at 48-pin package, LCD segment output 7 at 64-pin package, LCD segment output 7 at 100-pin package
    */
    __IO uint32_t PC_H_MFP;

    /**
     * PD_L_MFP
     * ===================================================================================================
     * Offset: 0x48  Port D Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PD0_MFP   |PD.0 Pin Function Selection
     * |        |          |0000 = GPIOD[0]
     * |        |          |1000 = LCD segment output 6 at 64-pin package, LCD segment output 6 at 100-pin package
     * |[7:4]   |PD1_MFP   |PD.1 Pin Function Selection
     * |        |          |0000 = GPIOD[1]
     * |        |          |1000 = LCD segment output 5 at 64-pin package, LCD segment output 5 at 100-pin package
     * |[11:8]  |PD2_MFP   |PD.2 Pin Function Selection
     * |        |          |0000 = GPIOD[2]
     * |        |          |1000 = LCD segment output 4 at 64-pin package, LCD segment output 4 at 100-pin package
     * |[15:12] |PD3_MFP   |PD.3 Pin Function Selection
     * |        |          |0000 = GPIOD[3]
     * |        |          |1000 = LCD segment output 3 at 64-pin package, LCD segment output 3 at 100-pin package
     * |[19:16] |PD4_MFP   |PD.4 Pin Function Selection
     * |        |          |0000 = GPIOD[4]
     * |        |          |0100 = SmartCard1 RST pin
     * |        |          |1000 = LCD segment output 2 at 64-pin package, LCD segment output 2 at 100-pin package
     * |[23:20] |PD5_MFP   |PD.5 Pin Function Selection
     * |        |          |0000 = GPIOD[5]
     * |        |          |1000 = LCD segment output 1 at 64-pin package(or as LD_COM5), LCD segment output 1 at 100-pin package(or as LD_COM5)
     * |[27:24] |PD6_MFP   |PD.6 Pin Function Selection
     * |        |          |0000 = GPIOD[6]
     * |        |          |1000 = LCD segment output 0 at 64-pin package(or as LD_COM4), LCD segment output 0 at 100-pin package(or as LD_COM4)
     * |[31:28] |PD7_MFP   |PD.7 Pin Function Selection
     * |        |          |0000 = GPIOD[7]
     * |        |          |0100 = SmartCard1 clock pin(SC1_UART_TXD)
     * |        |          |1000 = LCD common output 3 at 48-pin package, LCD common output 3 at 64-pin, LCD common output 3 at 100-pin package
    */
    __IO uint32_t PD_L_MFP;

    /**
     * PD_H_MFP
     * ===================================================================================================
     * Offset: 0x4C  Port D High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PD8_MFP   |PD.8 Pin Function Selection
     * |        |          |0000 = GPIOD[8]
     * |        |          |0100 = SmartCard1 DATA pin(SC1_UART_RXD)
     * |        |          |1000 = LCD common output 2 at 48-pin, LCD common output 2 at 64-pin package, LCD common output 2 at 100-pin package
     * |[6:4]   |PD9_MFP   |PD.9 Pin Function Selection
     * |        |          |0000 = GPIOD[9]
     * |        |          |0011 = PWM0 Channel3 output
     * |        |          |0100 = SmartCard1 RST pin
     * |        |          |1000 = LCD common output 1 at 48-pin, LCD common output 1 at 64-pin package, LCD common output 1 at 100-pin package
     * |[10:8]  |PD10_MFP  |PD.10 Pin Function Selection
     * |        |          |0000 = GPIOD[10]
     * |        |          |0010 = Timer1 capture input
     * |        |          |0011 = PWM0 Channel2 output
     * |        |          |1000 = LCD common output 0 at 48-pin, LCD common output 0 at 64-pin package, LCD common output 0 at 100-pin package
     * |[14:12] |PD11_MFP  |PD.11 Pin Function Selection
     * |        |          |0000 = GPIOD[11]
     * |        |          |0010 = Timer0 capture input
     * |        |          |0011 = PWM0 Channel1 output
     * |        |          |1000 = LCD external capacitor pin of charge pump circuit at 64-pin package, LCD external capacitor pin of charge pump circuit at 100-pin package
     * |[18:16] |PD12_MFP  |PD.12 Pin Function Selection
     * |        |          |0000 = GPIOD[12]
     * |        |          |0001 = Frequency Divider0 output pin
     * |        |          |0010 = Timer1 external counter input or Timer1 toggle out
     * |        |          |0011 = PWM0 Channel0 output
     * |        |          |1000 = LCD external capacitor pin of charge pump circuit at 64-pin package, LCD external capacitor pin of charge pump circuit at 100-pin package
     * |        |          |1001 = 1, 1/2, 1/4, 1/16 Hz clock output
     * |[22:20] |PD13_MFP  |PD.13 Pin Function Selection
     * |        |          |0000 = GPIOD[13]
     * |        |          |0001 = External interrupt 1 input pin
     * |        |          |1000 = LCD Unit voltage for LCD charge pump circuit at 48-pin package, LCD Unit voltage for LCD charge pump circuit at 64-pin package, LCD Unit voltage for LCD charge pump circuit at 100-pin package
     * |[27:24] |PD14_MFP  |PD.14 Pin Function Selection
     * |        |          |0000 = GPIOD[14]
     * |        |          |1000 = LCD Unit voltage for LCD charge pump circuit at 48-pin package, LCD Unit voltage for LCD charge pump circuit at 64-pin package, LCD Unit voltage for LCD charge pump circuit at 100-pin package
     * |[30:28] |PD15_MFP  |PD.15 Pin Function Selection
     * |        |          |0000 = GPIOD[15]
     * |        |          |1000 = LCD Unit voltage for LCD charge pump circuit at 48-pin package, LCD Unit voltage for LCD charge pump circuit at 64-pin package, LCD Unit voltage for LCD charge pump circuit at 100-pin package
    */
    __IO uint32_t PD_H_MFP;

    /**
     * PE_L_MFP
     * ===================================================================================================
     * Offset: 0x50  Port E Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |PE0_MFP   |PE.0 Pin Function Selection
     * |        |          |0000 = GPIOE[0]
     * |        |          |0110 = SPI0 1st MOSI (Master Out, Slave In) pin
     * |[6:4]   |PE1_MFP   |PE.1 Pin Function Selection
     * |        |          |0000 = GPIOE[1]
     * |        |          |0110 = SPI0 1st MISO (Master In, Slave Out) pin
     * |[10:8]  |PE2_MFP   |PE.2 Pin Function Selection
     * |        |          |0000 = GPIOE[2]
     * |        |          |0110 = SPI0 serial clock pin
     * |[15]    |PE3_MFP   |PE.3 Pin Function Selection
     * |        |          |0000 = GPIOE[4]
     * |        |          |0110 = SPI0 1st slave select pin
     * |[18:16] |PE4_MFP   |PE.4 Pin Function Selection
     * |        |          |0000 = GPIOE[4]
     * |        |          |0100 = SmartCard1 RST pin
     * |[23:20] |PE5_MFP   |PE.5 Pin Function Selection
     * |        |          |0000 = GPIOE[5]
     * |        |          |0100 = SmartCard1 PWR pin
     * |[27:24] |PE6_MFP   |PE.6 Pin Function Selection
     * |        |          |0000 = GPIOE[6]
     * |        |          |0100 = SmartCard1 clock pin(SC1_UART_TXD)
     * |[31:28] |PE7_MFP   |PE.7 Pin Function Selection
     * |        |          |0000 = GPIOE[7]
     * |        |          |0100 = SmartCard1 DATA pin(SC1_UART_RXD)
    */
    __IO uint32_t PE_L_MFP;

    /**
     * PE_H_MFP
     * ===================================================================================================
     * Offset: 0x54  Port E High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PE8_MFP   |PE.8 Pin Function Selection
     * |        |          |0000 = GPIOE[8]
     * |        |          |0011 = PWM0 Channel2 output
     * |        |          |1000 = LCD segment output 30 at 100-pin package
     * |[7:4]   |PE9_MFP   |PE.9 Pin Function Selection
     * |        |          |0000 = GPIOE[9]
     * |        |          |0011 = PWM0 Channel3 output
     * |        |          |1000 = LCD segment output 29 at 100-pin package
    */
    __IO uint32_t PE_H_MFP;

    /**
     * PF_L_MFP
     * ===================================================================================================
     * Offset: 0x58  Port F Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PF0_MFP   |PF.0 Pin Function Selection
     * |        |          |0000 = GPIOF[1]
     * |        |          |0010 = Timer3 external counter input or Timer3 toggle out.
     * |        |          |1111 = External 32.768 kHz crystal input pin(default)
     * |[7:4]   |PF1_MFP   |PF.1 Pin Function Selection
     * |        |          |0000 = GPIOF[1]
     * |        |          |0010 = Timer2 external counter input or Timer2 toggle out.
     * |        |          |1111 = External 32.768 kHz crystal output pin(default)
     * |[11:8]  |PF2_MFP   |PF.2 Pin Function Selection
     * |        |          |0000 = GPIOF[2]
     * |        |          |0001 = External interrupt1 input pin
     * |        |          |0010 = Timer3 capture input
     * |        |          |0111 = UART1 Data receiver input pin
     * |        |          |1111 = External 4~24 MHz crystal input pin(default)
     * |[15:12] |PF3_MFP   |PF.3 Pin Function Selection
     * |        |          |0000 = GPIOF[3]
     * |        |          |0001 = External interrupt0 input pin
     * |        |          |0010 = Timer 2 capture input
     * |        |          |0111 = UART1 Data transmitter output pin(This pin could modulate with PWM0 output. Please refer PWM_SEL(UARTx_CTL[26:24])).
     * |        |          |1111 = External 4~24 MHz crystal output pin
     * |[19:16] |PF4_MFP   |PF.4 Pin Function Selection
     * |        |          |0000 = GPIOF[4]
     * |        |          |0001 = Frequency Divider1 output pin
     * |        |          |0010 = Timer1 capture input
     * |        |          |0011 = PWM0 Channel2 output
     * |        |          |1001 = 1, 1/2, 1/4, 1/8, 1/16 Hz clock output
     * |        |          |1111 = Serial Wired Debugger Clock pin
     * |[23:20] |PF5_MFP   |PF.5 Pin Function Selection
     * |        |          |0000 = GPIOF[5]
     * |        |          |0010 = Timer0 capture input
     * |        |          |0011 = PWM0 Channel3 output
     * |        |          |1001 = Comparator0 charge/discharge path
     * |        |          |1111 = Serial Wired Debugger Data pin
    */
    __IO uint32_t PF_L_MFP;
    uint32_t RESERVE2[1];


    /**
     * PORCTL
     * ===================================================================================================
     * Offset: 0x60  Power-On-Reset Controller Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |POR_DIS_CODE|Power-On Reset Enable Control
     * |        |          |This is a protected register. Please refer to open lock sequence to program it.
     * |        |          |When powered on, the POR circuit generates a reset signal to reset the whole chip function, but noise on the power may cause the POR active again.
     * |        |          |If setting the POR_DIS_CODE to 0x5AA5, the POR reset function will be disabled and the POR function will be active again when POR_DIS_CODE is set to another value or POR_DIS_CODE is reset by chip other reset functions, including: /RESET, Watchdog Timer reset, BOD reset, ICE reset command and the software-chip reset function.
    */
    __IO uint32_t PORCTL;

